# see https://github.com/Homebrew/homebrew-bundle for example brewfile

tap 'homebrew/cask'
tap 'homebrew/services'

cask 'kitty'
cask 'iterm2'
# cask 'dropbox'
# tap 'homebrew/cask-drivers'
cask 'logitech-options'

tap 'homebrew/cask-fonts'
cask 'font-jetbrains-mono-nerd-font'

brew 'rbenv'
brew "pyenv"
brew 'openjdk'
brew 'dotbot'
# brew 'zinit' # do not brew, instead, manually git clone to data folder in setup.zsh
brew 'mas' # brew installer for the mac app store

brew 'lua'
brew 'luarocks'
brew 'rustup-init' # aka rustup
brew 'bash'
brew 'zsh'
brew 'cmake' # needed for luaformatter installed via luarocks

# brew 'neovim', args: ['HEAD']
brew 'neovim'
brew 'tmux'
tap 'koekeishiya/formulae'
# brew 'koekeishiya/formulae/skhd', restart_service: true
brew 'koekeishiya/formulae/skhd'
# brew 'koekeishiya/formulae/yabai', args: ['HEAD'], restart_service: true
brew 'koekeishiya/formulae/yabai' 
tap 'cmacrae/formulae'
cask 'spaceman'
cask 'shortcutdetective'
cask 'vlc'
cask 'visual-studio-code'
cask 'meetingbar'
cask 'anki'
cask 'qutebrowser'

# brew 'gnu-getopt'
brew 'less'
brew 'mysql'
brew 'openssh'
brew 'awscli'
brew 'coreutils'
brew 'gnu-sed'
brew 'gawk'
brew 'git'
brew 'gh'
brew 'git-delta'
tap 'jesseduffield/lazygit' # use tap to get frequent updates
brew 'jesseduffield/lazygit/lazygit'
# tap does not support m1 mac https://github.com/jesseduffield/lazydocker/issues/279
# brew 'jesseduffield/lazydocker/lazydocker'
# brew 'lazydocker'
brew 'rsync'
brew 'fzf'
brew 'ripgrep'
brew 'bat'
brew 'fd'
brew 'lsd'
brew 'exa'
brew 'jq'
brew 'yq'
brew 'lf'
brew 'gnupg'
brew 'pass' # password store
brew 'pass-otp' # password store
brew 'imagemagick'
# brew 'pygments' # try to fix httpie pyments colors
brew 'httpie'
# brew 'hyperfine'
# brew 'redis', restart_service: true
brew 'redis'

cask 'docker'
cask 'alfred'
cask '1password'
cask 'nvalt'
# cask 'lastpass'
cask 'ithoughtsx'
cask 'time-out'
cask 'istat-menus'
# cask 'bartender'
cask 'cleanshot'
# cask 'toggl-track'
cask 'ngrok'

# cask 'foxitreader'
# cask 'google-chrome'
# cask 'brave-browser'
cask 'firefox'
cask 'karabiner-elements'
cask 'postman'
# cask 'houdahspot'
# cask 'hook'
# cask 'pixelsnap'
cask 'keyboard-maestro'
# cask 'cold-turkey-blocker'
# cask 'glyphfinder'
cask 'transmit'
cask 'slack'
cask 'zoom'
cask 'hazel'
cask 'spotify'

# tap 'homebrew/cask-drivers'
cask 'zsa-wally'

# mas 'Aquarelo', id: 1263012549
# mas 'Goldie', id: 1375037046

brew 'tealdeer'
# brew 'mutt'
# brew 'neomutt'
# brew 'lynx' # used by mutt to view html?
# brew 'notmuch' # index email
# brew 'abook'
# brew 'mpv' # used by neomutt config to view videos
brew 'parallel'
brew 'htop'
brew 'glances'
brew 'dust'
brew 'bottom'
brew 'tokei'
brew 'bandwhich'
# brew 'git-filter-repo'
brew 'fx'
tap 'khanhas/tap'
brew 'khanhas/tap/spicetify-cli'
brew 'zbar'
brew 'gzip'
brew 'gnu-tar'
brew 'tokei'
brew 'ffmpeg'
brew 'mycli'
brew 'glow'
brew 'choose-rust'
brew 'gron'
brew 'entr'
brew 'lnav'
brew 'btop'
# brew 'localstack'
brew 'viddy'
brew 'jo'
brew 'angle-grinder'
brew 'sampler'
brew 'pgcli'
cask 'qutebrowser'
brew 'gojq'
brew 'zoxide'
# brew 'nginx'
# brew 'consul'
brew 'duf'


tap 'jkfran/killport'
brew 'killport'
brew 'act'
brew 'pcalc'
brew 'dog'
# brew 'sonar-scanner'
cask 'orbstack'
brew 'hex' # modern hexdump
brew 'hexyl'
brew 'aichat'
# tap 'ankitpokhrel/jira-cli'
# brew 'jira-cli'
# brew 'chafa' # image previewer svg?
brew 'viu' # rust image previewer
tap 'dbcli/tap'
brew 'pgcli'
brew 'postgresql@15'
brew 'sd' # rust sed
# brew 'turbot/tap/steampipe'
# brew 'percona-toolkit'
# tap 'yqrashawn/goku'
# brew 'yqrashawn/goku/goku'
# haskell formatter
# cask 'zprint'

# tap 'noahgorstein/tap/jqp'
tap 'noahgorstein/tap'
brew 'noahgorstein/tap/jqp'
# brew 'jqp'
# brew 'vips'  # fix Something went wrong installing the "sharp" module when running yarn on rc main
tap 'minio/stable'
brew 'minio/stable/minio'
brew 'minio/stable/mc'
brew 'ipinfo-cli'
brew 'solargraph'
