# see https://github.com/Homebrew/homebrew-bundle for example brewfile

tap 'homebrew/cask'
tap 'homebrew/services'
# tap 'homebrew/bundle'

cask 'kitty'
cask 'iterm2'
cask 'dropbox'
tap 'homebrew/cask-drivers'
cask 'logitech-options'

tap 'homebrew/cask-fonts'
cask 'font-jetbrains-mono-nerd-font'
# cask 'font-fontawesome'

brew 'rbenv'
brew "pyenv"
brew 'dotbot'
# brew 'zinit' # do not brew, instead, manually git clone to data folder in setup.zsh
brew 'mas' # brew installer for the mac app store

brew 'lua'
brew 'lua-language-server'
brew 'luarocks'
brew 'rustup-init' # aka rustup
brew 'bash'
brew 'zsh'
brew 'cmake' # needed for luaformatter installed via luarocks
brew 'solargraph' # ruby lang server

brew 'neovim'
brew 'tmux'
tap 'koekeishiya/formulae'
brew 'koekeishiya/formulae/yabai', args: ['HEAD'], restart_service: true
brew 'koekeishiya/formulae/skhd', restart_service: true
tap 'cmacrae/formulae'
# brew 'cmacrae/formulae/spacebar', restart_service: true
cask 'spaceman'

brew 'less'
brew 'mysql'
brew 'openssh'
brew 'awscli'
brew 'coreutils'
brew 'gnu-sed'
brew 'gawk'
brew 'git'
brew 'gh'
brew 'git-delta'
tap 'jesseduffield/lazygit' # use tap to get frequent updates
brew 'jesseduffield/lazygit/lazygit'
# tap does not support m1 mac https://github.com/jesseduffield/lazydocker/issues/279
# brew 'jesseduffield/lazydocker/lazydocker'
brew 'lazydocker'
brew 'rsync'
brew 'fzf'
brew 'ripgrep'
brew 'bat'
brew 'fd'
brew 'lsd'
brew 'exa'
brew 'jq'
brew 'yq'
brew 'shfmt'
brew 'lf'
brew 'gnupg'
brew 'pass' # password store
brew 'pass-otp' # password store
brew 'imagemagick'
brew 'httpie'
brew 'hyperfine'
# brew 'redis', restart_service: true
brew 'redis'
brew 'tealdeer'
brew 'mutt'
brew 'neomutt'
brew 'lynx' # used by mutt to view html?
brew 'notmuch' # index email
brew 'abook'
brew 'mpv' # used by neomutt config to view videos
brew 'parallel'
brew 'htop'
brew 'glances'
brew 'dust'
brew 'sd'
brew 'bottom'
brew 'tokei'
brew 'bandwhich'
brew 'git-filter-repo'
brew 'fx'
tap 'khanhas/tap'
brew 'khanhas/tap/spicetify-cli'
brew 'zbar'
brew 'gzip'
brew 'gnu-tar'
brew 'ledger'

# run brew bundle to run this file
cask 'docker'
cask 'alfred'
cask '1password'
cask '1password-cli'
cask 'nvalt'
cask 'authy'
cask 'lastpass'
cask 'ithoughtsx'
cask 'time-out'
cask 'istat-menus'
cask 'bartender'
cask 'cleanshot'
cask 'toggl-track'
# cask 'snagit' # doesn't work for old versions of snagit
# cask 'sip'
# cask 'balsamiq-wireframes'

cask 'microsoft-excel'
cask 'foxitreader'
cask 'google-chrome'
cask 'brave-browser'
cask 'firefox'
cask 'microsoft-edge'
cask 'karabiner-elements'
cask 'postman'
cask 'forklift'
cask 'houdahspot'
cask 'proxyman'
cask 'hook'
cask 'pixelsnap'
cask 'keyboard-maestro'
cask 'cold-turkey-blocker'
cask 'glyphfinder'
cask 'marked'
cask 'vlc'
cask 'transmit'
cask 'devutils'
cask 'affinity-photo'
cask 'affinity-designer'
cask 'affinity-publisher'
cask 'slack'
cask 'zoom'
cask 'notion'
cask 'hazel'
cask 'sequel-pro'
cask 'alt-tab'

tap 'homebrew/cask-drivers'
cask 'zsa-wally'

mas 'Magnet', id: 441258766
mas 'Things', id: 904280696
mas 'Blackmagic Disk Speed Test', id: 425264550
mas 'Aquarelo', id: 1263012549
mas 'Goldie', id: 1375037046
# mas 'Smart Countdown Timer', id: 1410709951
